<!-- dflook/terraform-github-actions {"workspace":"ephemeral","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"a1d87a8c4783a991e9c2665d59253b24e0fb68cb6f9f1e3f8d63838ba7a06641","plan_job_ref":"Job Test actions using target and replace #450 at https://github.com/dflook/terraform-github-actions/actions/runs/12751825810","plan_hash":"44ae9d7e688aae0f2908af71f18808ada5c035fac8b38c1b7bd25961c059c6d6","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __ephemeral__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] must be replaced
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      length      = 10 -> 6 # forces replacement
!~      result      = "**********" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
!~  foreach = "lkwAPhjj8w" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test actions using target and replace #450](https://github.com/dflook/terraform-github-actions/actions/runs/12751825810)